{
  "auto_mapping": null,
  "base_model_name_or_path": "bert-base-uncased",
  "bias": "all",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 16,
  "lora_dropout": 0.1,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 64,
  "revision": null,
  "target_modules": [
    "query",
    "key",
    "value",
    "classifier"
  ],
  "task_type": "TOKEN_CLS"
}